docs/blog/posts/illiterate.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-09-25 Thu 19:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Am I the Illiterate Youth?</title>
<meta name="author" content="Noelle Crawford" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Am I the Illiterate Youth?
<br />
<span class="subtitle">Why I'm trying to read more fiction.</span>
</h1>
<p>
Like many people I know, I used to read <i>a lot</i> in elementary school, but lost interst later on for some assortment of rational.
For the past few years I've been rediscovering my love for books -- mostly non-fiction. It started with "history of technology style books" as I like learning the stories behind great technologies and I find the characters (mostly famous engineers) easy to relate to. 
From there I branched out and started reading other non-ficiton: non-tech. histories, books on economics, and even a bit of philosophy. 
</p>

<p>
Once in a while I'll pick up a sci-fi or fantasy book, especially when the Hugos/other awards come out, but for the most part, I find fiction much harder to finish, and often find myself needing external motivation (i.e., reading buddies).
</p>

<p>
However, a few days ago I had a conversation with a friend which gave me pause -- 
</p>
<ul class="org-ul">
<li>told her non-fiction was an easy way to unwind, usually layed out for you and you're clearly "getting someting"</li>
</ul>
<p>
With some noteable exceptions (i.e., <a href="file:///home/noelle/fun/website/src/media/reviews/books/godel_escher_bach.html">G.E.B.</a>), non-fiction is much easier to read than fiction.
Good non-fiction ... is academic writing or journalism.
In contrast, good fiction is full of subtlety. Authors will purposefully build layered stories that can be analyzed over the course of many reads without graphing all of what is being said. Getting the most out of fiction requires work, and in some cases, getting anything at all can require work.
</p>

<p>
A few months ago my book club decided to read Erewhon. It was my suggestion, as I had an upcoming trip planned to L.A. and thought that if I was going to visit the store, I should have some understanding of its namesake.
It's also a book that <i>should</i> be relevant to the current technological landscape and has been referrenced by many well known historical figures I respect (Turing).
</p>
<ul class="org-ul">
<li>We all read ~1 chapter before pivoting to a different book. It's written in 1872, hard to read.</li>
<li>At the end of the day, it is english, and it's not that long.</li>
</ul>

<p>
In fear of admitting to illiteracy, I've gone back and finished Erewhon (you can read my review <a href="file:///home/noelle/fun/website/src/media/reviews/books/erewhon.html">here</a>).
While I still wasn't the biggest fan, it was a decent read, and I'm glad to have read it. 
I plan to make more of an effort to incorporate <i>good</i> fiction into my book selections, since after all, there's only so much room for good ideas in reality. Sometimes, to understand the world we need to sit down and think about...
</p>
</div>
<div id="postamble" class="status">
<p class="author">Author: Noelle Crawford</p>
<p class="date">Created: 2025-09-25 Thu 19:07</p>
</div>
</body>
</html>
